In [1]:
import pandas as pd
from sklearn.preprocessing import StandardScaler, MinMaxScaler

# 1. 构建原始数据
df = pd.DataFrame([['Kelly, Mr. James', 'male', 'Q',25],
                   ['Ilieff, Mr. Ylio', 'male', 'S',36],
                   ['Connolly, Miss. Kate', 'female', 'Q',55],
                   ['Keane, Mr. Daniel', 'male', 'Q',45],
                   ['Assaf, Mr. Gerios', 'male', 'C',18]],
                   columns=['name', 'sex', 'Embarked', 'age'])

In [3]:
# 2. 标准化处理
scaler_standard = StandardScaler()
df['age_standardized'] = scaler_standard.fit_transform(df[['age']])

# 3. 归一化处理
scaler_minmax = MinMaxScaler()
df['age_normalized'] = scaler_minmax.fit_transform(df[['age']])

df.head()

,name,sex,Embarked,age,age_standardized,age_normalized
0,"Kelly, Mr. James",male,Q,25,-0.810953,0.189189
1,"Ilieff, Mr. Ylio",male,S,36,0.015018,0.486486
2,"Connolly, Miss. Kate",female,Q,55,1.441695,1.000000
3,"Keane, Mr. Daniel",male,Q,45,0.690812,0.729730
4,"Assaf, Mr. Gerios",male,C,18,-1.336571,0.000000

In [4]:
df_encoded = pd.get_dummies(df, columns=['sex', 'Embarked'])
df_encoded

,name,age,age_standardized,age_normalized,sex_female,sex_male,Embarked_C,Embarked_Q,Embarked_S
0,"Kelly, Mr. James",25,-0.810953,0.189189,False,True,False,True,False
1,"Ilieff, Mr. Ylio",36,0.015018,0.486486,False,True,False,False,True
2,"Connolly, Miss. Kate",55,1.441695,1.000000,True,False,False,True,False
3,"Keane, Mr. Daniel",45,0.690812,0.729730,False,True,False,True,False
4,"Assaf, Mr. Gerios",18,-1.336571,0.000000,False,True,True,False,False